Case_set_up/Blow_Ratio_Effect/M066/Allrun
blockMesh 
checkMesh 
decomposePar 
mpirun -np 6 buoyantBoussinesqSimpleFoam -parallel 
reconstructPar
